class DuroodSharifConstants {
  final String title;
  final String englishTitle;
  final String duroodsharif;
  final String translation;

  DuroodSharifConstants({
    required this.title,
    required this.englishTitle,
    required this.duroodsharif,
    required this.translation,
  });
}

List<DuroodSharifConstants> duroodpakList = [
  DuroodSharifConstants(
    title: "جمعي کان اڳ واري رات لاءِ صلوات النبي",
    englishTitle: "Salawat An-Nabi for the Night Before Friday",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلٰی سَیِّدِنَا مُحَمَّدٍ النَّبِیِّ الْاُمِّیِّ الْحَبِیْبِ الْعَالِی الْقَدْرِ الْعَظِیْمِ الْجَاہِ وَعَلٰی اٰلِہٖ وَصَحْبِہٖ وَسَلِّمْ",
    translation:
        "بزرگن فرمايو ته جيڪو شخص هر جمعي جي رات (جمعرات ۽ جمعي جي وچ واري رات) هن درود شريف کي گهٽ ۾ گهٽ هڪ ڀيرو پابنديءَ سان پڙهندو، سو موت جي وقت سرکار مدينه صلي الله تعاليٰ عليه وآله وسلم جي زيارت ڪندو ۽ قبر ۾ داخل ٿيڻ وقت به، ايتري قدر جو هو ڏسندو ته سرکار مدينه صلي الله تعاليٰ عليه وآله وسلم کيس پنهنجي رحمت ڀريل هٿن سان قبر ۾ لاهي رهيا آهن. (افضل الصلوٰۃ علیٰ سید السادات صفحو 151)",
  ),
  DuroodSharifConstants(
    title: "سڀئي گناھ معاف",
    englishTitle: "All Sins Forgiven",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِ نَا وَ مَوْلَانَا مُحَمَّدٍ وَّعَلٰی اٰلِہٖ وَسَلِّمْ",
    translation:
        "حضرت سيدنا انس رضي الله تعاليٰ عنه کان روايت آهي ته تاجدار مدينه صلي الله تعاليٰ عليه وآله وسلم فرمايو: جيڪو شخص هي درود پاڪ پڙهي، اگر هو بيٺل هجي ته ويهڻ کان اڳ ۽ اگر ويٺل هجي ته بيهڻ کان اڳ، ان جا گناهه معاف ڪيا ويندا. (افضل الصلوات علی سید السادات،الصلاۃ الحادیۃ عشرۃ، ص ۶۵)",
  ),
  DuroodSharifConstants(
    title: "رحمت جا 70 دروازا",
    englishTitle: "70 Doors of Mercy",
    duroodsharif: "صَلَّی اللّٰہُ عَلٰی مُحَمَّدٍ",
    translation:
        "جيڪو شخص هي درود پاڪ پڙهندو آهي، ان تي رحمت جا 70 دروازا کوليا ويندا آهن. (القول البادی، صفحو 277)",
  ),
  DuroodSharifConstants(
    title: "ڇھ لک صلوات الانبياء جو ثواب",
    englishTitle: "Reward of 600,000 Salutations",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ عَدَدَ مَا فِیْ عِلْمِ اللّٰہِ صَلَاۃً دَاۤئِمَۃًۢ بِدَوَامِ مُلْكِ اللّٰہِ",
    translation:
        "حضرت احمد صاوي عليه رحمة الله الهادي ڪجهه بزرگن کان نقل ڪن ٿا: هي درود شريف هڪ ڀيرو پڙهڻ سان ڇهه لک درود شريف پڙهڻ جو ثواب حاصل ٿئي ٿو. (افضل الصلوٰۃ علیٰ سید السادات صفحو 149)",
  ),
  DuroodSharifConstants(
    title: "نبي ڪريم ﷺ جي قربت",
    englishTitle: "Closeness to Prophet Muhammad ﷺ",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ عَلٰی مُحَمَّدٍ کَمَا تُحِبُّ وَ تَرضٰی لَہٗ",
    translation:
        "هڪ ڏينهن هڪ شخص آيو ته حضور انور صلي الله تعاليٰ عليه وآله وسلم کيس پنهنجي ۽ صديق اڪبر رضي الله تعاليٰ عنه جي وچ ۾ ويهاريو. ان مان صحابہ ڪرام رضي الله تعاليٰ عنهم کي تعجب ٿيو ته هي ڪهڙو صاحب مرتبہ آهي! جڏهن هو هليو ويو ته سرکار صلي الله تعاليٰ عليه وآله وسلم فرمايو: هي جڏهن مون تي درود پاڪ پڙهندو آهي ته اهڙي طرح پڙهندو آهي. (القول البادي، صفحو 125)",
  ),
  DuroodSharifConstants(
    title: "درود شفاعت",
    englishTitle: "Durood of Intercession",
    duroodsharif:
        "اَللّٰہُمَّ صَلِّ عَلٰی مُحَمَّدٍ وَّ اَنْزِلْہُ الْمَقْعَدَ الْمُقَرَّبَ عِنْدَكَ یَوْمَ الْقِیَامَۃِ",
    translation:
        "شافع امم صلي الله تعاليٰ عليه وآله وسلم جو فرمان معظم آهي: جيڪو شخص اهڙي طرح درود پاڪ پڙهي، ان لاءِ منهنجي شفاعت واجب ٿي وڃي ٿي. (عطارغیب وطہرہیب، جلد 2، صفحو 329، حديث 31)",
  ),
  DuroodSharifConstants(
    title: "هزار ڏينهن جي نيڪ عملن جو ثواب",
    englishTitle: "Reward of 1000 Days of Good Deeds",
    duroodsharif: "جَزَی اللّٰہُ عَنَّا مُحَمَّدًا مَا ھُوَ اَھْلُہٗ",
    translation:
        "سيدنا ابن عباس رضي الله عنهما کان روايت آهي ته نبي ڪريم ﷺ فرمايو: جيڪو شخص هي دعا پڙهندو، ان لاءِ ستر فرشتا هزار ڏينهن جي نيڪيون لکندا. (مجمع الزوائد، صفحو 254، جلد 10، حديث 17305)",
  ),
  DuroodSharifConstants(
    title: "هر رات عبادت ۾ گذارڻ جو آسان طريقو",
    englishTitle: "Easy Way to Spend the Night in Worship",
    duroodsharif:
        "لَآ اِلٰهَ اِلَّا اللّٰهُ الۡحَلِيۡمُ الۡكَرِيۡمُ سُبۡحٰنَ اللّٰهِ رَبِّ السَّمٰوٰتِ السَّبۡعِ وَ رَبِّ الۡعَرۡشِ الۡعَظِيۡم",
    translation:
        "(تاریخ ابنِ عساکر،۱۹/۱۵۵،حدیث:۴۴۱۵) فرمان مصطفيٰ صلي الله تعاليٰ عليه وآله وسلم: جنهن هن دعا کي ٽي ڀيرا پڙهيو، سو گويا هن شب قدر حاصل ڪري ورتي.",
  ),
];
