class DuroodSharifConstants {
  final String title;
  final String englishTitle;
  final String duroodsharif;
  final String translation;

  DuroodSharifConstants({
    required this.title,
    required this.englishTitle,
    required this.duroodsharif,
    required this.translation,
  });
}

List<DuroodSharifConstants> duroodpakList = [
  DuroodSharifConstants(
    title: "جمعي کان اڳ واري رات لاءِ صلوات النبي",
    englishTitle: "Salawat An-Nabi for the Night Before Friday",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلٰی سَیِّدِنَا مُحَمَّدٍ النَّبِیِّ الْاُمِّیِّ الْحَبِیْبِ الْعَالِی الْقَدْرِ الْعَظِیْمِ الْجَاہِ وَعَلٰی اٰلِہٖ وَصَحْبِہٖ وَسَلِّمْ",
    translation:
        "اسلام جي اوليائن نقل ڪيو آهي ته جيڪو شخص جمعي کان اڳ واري رات ۾ گهٽ ۾ گهٽ هڪ ڀيرو هي درود شريف پڙهندو، ان کي اسان جو پيارو نبي ﷺ جو ديدار نصيب ٿيندو. الله تعالى ان تي رحم فرمائيندو ۽ ان کي سلامتي عطا فرمائيندو مرڻ وقت، قبر ۾ دفن وقت، ايستائين جو نبي ڪريم ﷺ ان کي پنهنجي مهربان هٿن سان قبر ۾ اتاريندو. (افضل الصلوٰۃ علیٰ سید السادات صفحو 151)",
  ),
  DuroodSharifConstants(
    title: "سڀئي گناھ معاف",
    englishTitle: "All Sins Forgiven",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِ نَا وَ مَوْلَانَا مُحَمَّدٍ وَّعَلٰی اٰلِہٖ وَسَلِّمْ",
    translation:
        "سيدنا انس رضي الله عنه کان روايت آهي ته پيارو ۽ بابرڪت نبي ﷺ فرمايو: جيڪو شخص بيٺي پڙھي، پوءِ ويهڻ کان اڳ، ۽ جيڪڏهن ويٺي پڙھي ته بيهڻ کان اڳ، ان جا سڀئي گناھ معاف ڪيا ويندا. (ibid، صفحو 65)",
  ),
  DuroodSharifConstants(
    title: "رحمت جا 70 دروازا",
    englishTitle: "70 Doors of Mercy",
    duroodsharif: "صَلَّی اللّٰہُ عَلٰی مُحَمَّدٍ",
    translation:
        "جيڪو شخص هي درود شريف پڙهي، ان لاءِ رحمت جا 70 دروازا کلي ويندا. (القول البادی، صفحو 277)",
  ),
  DuroodSharifConstants(
    title: "ڇھ لک صلوات الانبياء جو ثواب",
    englishTitle: "Reward of 600,000 Salutations",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ عَدَدَ مَا فِیْ عِلْمِ اللّٰہِ صَلَاۃً دَاۤئِمَۃًۢ بِدَوَامِ مُلْكِ اللّٰہِ",
    translation:
        "شيخ احمد صوي رحمت الله عليه نقل ڪيو آهي ته جيڪو شخص هي صلاۃ الانبياء پڙهي، ان کي ڇھ لک دفعا صلاۃ الانبياء پڙهڻ جو ثواب ملندو. (افضل الصلوٰۃ علیٰ سید السادات صفحو 149)",
  ),
  DuroodSharifConstants(
    title: "نبي ڪريم ﷺ جي قربت",
    englishTitle: "Closeness to Prophet Muhammad ﷺ",
    duroodsharif:
        "اَللّٰھُمَّ صَلِّ عَلٰی مُحَمَّدٍ کَمَا تُحِبُّ وَ تَرضٰی لَہٗ",
    translation:
        "هڪ ڏينهن هڪ شخص حضور ﷺ جي بارگاه ۾ حاضر ٿيو، حضور ﷺ ان کي پاڻ ۽ سيدنا ابوبڪر صديق رضي الله عنه جي وچ ۾ ويهاريو. صحابه حيران ٿي ويا ته هي معزز شخص ڪير آهي؟ جڏهن اهو روانو ٿيو ته حضور ﷺ فرمايو: جڏهن هو مون تي درود پڙهندو آهي ته هنن لفظن سان پڙهندو آهي. (القول البادي، صفحو 125)",
  ),
  DuroodSharifConstants(
    title: "درود شفاعت",
    englishTitle: "Durood of Intercession",
    duroodsharif:
        "اَللّٰہُمَّ صَلِّ عَلٰی مُحَمَّدٍ وَّ اَنْزِلْہُ الْمَقْعَدَ الْمُقَرَّبَ عِنْدَكَ یَوْمَ الْقِیَامَۃِ",
    translation:
        "سڀ کان عظيم ۽ پاڪ نبي ﷺ فرمايو: جيڪو شخص هي درود پڙهندو، ان لاءِ منهنجي شفاعت لازم ٿي ويندي. (عطارغیب وطہرہیب، جلد 2، صفحو 329، حديث 31)",
  ),
  DuroodSharifConstants(
    title: "هزار ڏينهن جي نيڪ عملن جو ثواب",
    englishTitle: "Reward of 1000 Days of Good Deeds",
    duroodsharif: "جَزَی اللّٰہُ عَنَّا مُحَمَّدًا مَا ھُوَ اَھْلُہٗ",
    translation:
        "سيدنا ابن عباس رضي الله عنهما کان روايت آهي ته نبي ڪريم ﷺ فرمايو: جيڪو شخص هي دعا پڙهندو، ان لاءِ ستر فرشتا هزار ڏينهن جي نيڪيون لکندا. (مجمع الزوائد، صفحو 254، جلد 10، حديث 17305)",
  ),
  DuroodSharifConstants(
    title: "هر رات عبادت ۾ گذارڻ جو آسان طريقو",
    englishTitle: "Easy Way to Spend the Night in Worship",
    duroodsharif:
        "لَآ اِلٰهَ اِلَّا اللّٰهُ الۡحَلِيۡمُ الۡكَرِيۡمُ سُبۡحٰنَ اللّٰهِ رَبِّ السَّمٰوٰتِ السَّبۡعِ وَ رَبِّ الۡعَرۡشِ الۡعَظِيۡم",
    translation:
        "غريب القرآن جي صفحي 187 تي روايت آهي ته 'جيڪو شخص رات جو ٽي ڀيرا هي دعا پڙهي ته ڄڻڪ هن ليليٰ القدر کي پايو.' اسان کي هر رات ان کي پڙهڻ گھرجي. هي دعا آهي.",
  ),
];
